Revit 2027 API
DigitGroupingAmount Enumeration
 The number of digits in each group when numbers are formatted with digit grouping.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum DigitGroupingAmount
Public Enumeration DigitGroupingAmount
public enum class DigitGroupingAmount
type DigitGroupingAmount
Members
Member name | Value | Description
Three | 1 |  Digits are in groups of three.
Two | 0 |  Digits are in groups of two, with the exception of the first group to the left of the decimal symbol which contains three digits.
See Also
Reference
Autodesk.Revit.DB Namespace